zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg01/atdf/PIC32CK1012SG01100.atdf
      <value-group name="AIRCR__SYSRESETREQ">
        <value name="NO" caption="Do not request a system reset" value="0"/>
        <value name="YES" caption="Request a system reset" value="1"/>
      </value-group>
      <value-group name="AIRCR__SYSRESETREQS">
        <value name="BOTH" caption="SYSRESETREQ functionality is available to both Security states" value="0x0"/>
        <value name="SECURE" caption="SYSRESETREQ functionality is only available to Secure state" value="0x1"/>
      </value-group>
      <value-group name="AIRCR__BFHFNMINS">
        <value name="SECURE" caption="BusFault, HardFault, and NMI are Secure" value="0x0"/>
        <value name="NON_SECURE" caption="BusFault and NMI are Non-secure and exceptions can target Non-secure HardFault" value="0x1"/>
      </value-group>
      <value-group name="AIRCR__PRIS">
        <value name="SAME" caption="Priority ranges of Secure and Non-secure exceptions are identical" value="0x0"/>
        <value name="NS_DEPRIO" caption="Non-secure exceptions are de-prioritized" value="0x1"/>
      </value-group>
      <value-group name="AIRCR__ENDIANNESS">
        <value name="LITTLE" caption="Little-endian" value="0"/>
        <value name="BIG" caption="Big-endian" value="1"/>
      </value-group>
      <value-group name="SCR__SLEEPONEXIT">
        <value name="VALUE_0" caption="O not sleep when returning to Thread mode" value="0"/>
        <value name="VALUE_1" caption="Enter sleep, or deep sleep, on return from an ISR" value="1"/>
      </value-group>
      <value-group name="SCR__SLEEPDEEP">
        <value name="VALUE_0" caption="Sleep" value="0"/>
        <value name="VALUE_1" caption="Deep sleep" value="1"/>
      </value-group>
      <value-group name="SCR__SEVONPEND">
        <value name="VALUE_0" caption="Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded" value="0"/>
        <value name="VALUE_1" caption="Enabled events and all interrupts, including disabled interrupts, can wakeup the processor" value="1"/>
      </value-group>
      <value-group name="CCR__UNALIGN_TRP">
        <value name="VALUE_0" caption="Do not trap unaligned halfword and word accesses" value="0"/>
        <value name="VALUE_1" caption="Trap unaligned halfword and word accesses" value="1"/>
      </value-group>
      <value-group name="ID_ISAR0__BitCount">
        <value name="CLZ" caption="CLZ supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR0__BitField">
        <value name="YES" caption="BFC, BFI, SBFX, and UBFX supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR0__CmpBranch">
        <value name="YES" caption="CBNZ and CBZ supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR0__Coproc">
        <value name="NO" caption="Only FPU coprocessor instructions" value="0"/>
        <value name="YES" caption="Coprocessor instructions supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR0__Debug">
        <value name="BKPT" caption="BKPT supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR0__Divide">
        <value name="YES" caption="SDIC and UDIV supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR1__Extend">
        <value name="YES" caption="SXTB, SXTH, UXTB, UXTH supported" value="1"/>
        <value name="DSP" caption="SXTB16, SXTAB, SXTAB16, SXTAH, UXTB16, iUXTAB, UXTAB16, and UXTAH supported" value="2"/>
      </value-group>
      <value-group name="ID_ISAR1__IfThen">
        <value name="IT" caption="IT supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR1__Immediate">
        <value name="YES" caption="ADDW, MOVW, MOVT, and SUBW supported" value="2"/>
      </value-group>
      <value-group name="ID_ISAR1__Interwork">
        <value name="YES" caption="BLX, BX, and loads to PC supported" value="2"/>
      </value-group>
      <value-group name="ID_ISAR2__LoadStore">
        <value name="YES" caption="Load-acquire, store-release, and exclusive load and store supported" value="2"/>
      </value-group>
      <value-group name="ID_ISAR2__MemHint">
        <value name="YES" caption="PLI and PLD supported" value="3"/>
      </value-group>
      <value-group name="ID_ISAR2__MultiAccessInt">
        <value name="NO" caption="LDM and STM are not interruptible" value="0"/>
        <value name="RESTART" caption="LDM and STM are restartable" value="1"/>
        <value name="CONTINUE" caption="LDM and STM are continuable" value="2"/>
      </value-group>
      <value-group name="ID_ISAR2__Mult">
        <value name="YES" caption="MUL, MLA, and MLS supported" value="2"/>
      </value-group>
      <value-group name="ID_ISAR2__MultS">
        <value name="YES" caption="SMULL and SMLAL supported" value="1"/>
        <value name="DSP" caption="All saturating and DSP signed multiplies supported" value="3"/>
      </value-group>
      <value-group name="ID_ISAR2__MultU">
        <value name="YES" caption="UMULL and UMLAL supported" value="2"/>
      </value-group>
      <value-group name="ID_ISAR2__Reversal">
        <value name="YES" caption="REV, REV16, REVSH, and RBIT supported" value="2"/>
      </value-group>
      <value-group name="ID_ISAR3__Saturate">
        <value name="NO" caption="No saturating instructions supported" value="0"/>
        <value name="DSP" caption="QADD, QDADD, QDSYB, QSUB and Q-bit supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR3__SIMD">
        <value name="YES" caption="SSAT, USAT, and Q-bit supported" value="1"/>
        <value name="DSP" caption="All packed arithmetic and GE-bits supported" value="3"/>
      </value-group>
      <value-group name="ID_ISAR3__SVC">
        <value name="YES" caption="SVC supported" value="1"/>
      </value-group>
      <value-group name="ID_ISAR3__SynchPrim">
        <value name="YES" caption="LDREX, STREX, LDREXB, STREXB, LDREXH, STREXH, and CLREX supported" value="1"/>
      </value-group>
